app/Helpers/app_helper.php

SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`user_id` = '4'
 LIMIT 1
---
function pelanggan()
{
    $model = new PelangganModel();
    $user = $model->where('pelanggan.user_id', session('user')->user_id)->first();